## Week 11, Lab 1: SQL Practice

> Author: Matt Brems

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the famous (but fake) Northwind database. It contains various tables of transactions. The schema for the Northwind database can be found [here](http://www.zentut.com/wp-content/uploads/downloads/2013/06/Northwind-Sample-Database-Diagram.pdf).

In [1]:
# Import Pandas and Create_Engine

import pandas as pd
from sqlalchemy import create_engine

# Set up the engine to access the data.
engine = create_engine('postgres://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind')

In [2]:
pd.read_sql_query(sql, engine)

NameError: name 'sql' is not defined

### Prompt 1

How many rows are there in the `customers` table of the Northwind database?

In [3]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT COUNT(*)
FROM customers
"""

pd.read_sql_query(sql, engine)

   count
0     91

**Prompt 1 Answer**:

### Prompt 2

If you sort the customers in alphabetical order by name, which customer is fourth?

In [4]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT "CompanyName"
from customers
LIMIT 1 OFFSET 3
"""

pd.read_sql_query(sql, engine)

       CompanyName
0  Around the Horn

**Prompt 2 Answer**:

### Prompt 3

Among those customers who live in Germany, if you sort the customers in alphabetical order by name, which customer is fourth?

In [5]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT "ContactName"
FROM customers
WHERE "Country" LIKE 'Germany'
ORDER BY "ContactName"
LIMIT 1 OFFSET 3
"""

pd.read_sql_query(sql, engine)

   ContactName
0  Horst Kloss

**Prompt 3 Answer**:

### Prompt 4

From the `employees` table, what are the first names of the individuals who have a birthdate in the 1960s?

In [6]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT "FirstName", "BirthDate"
FROM employees
WHERE "BirthDate" BETWEEN '1960-01-01' AND '1969-12-31'
"""

pd.read_sql_query(sql, engine)

  FirstName   BirthDate
0     Janet  1963-08-30
1   Michael  1963-07-02
2    Robert  1960-05-29
3      Anne  1966-01-27

**Prompt 4 Answer**:

### Prompt 5

In `order_details` table of the Northwind database, what is the total number of units sold for products 2, 3, and 4? 
> You should give us three numbers - one for each `ProductID`.

In [7]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT "ProductID", SUM("Quantity")
FROM order_details
WHERE "ProductID" IN (2, 3, 4)
GROUP BY "ProductID"


"""

pd.read_sql_query(sql, engine)

   ProductID   sum
0          2  1057
1          3   328
2          4   453

**Prompt 5 Answer**:

### Prompt 6

From the `order_details` table of the Northwind database, calculate the revenue per product. In your SQL output, rename the revenue column `Revenue` and sort your results from largest revenue per product to smallest revenue per product. Which `ProductID` has the fifth-highest revenue, and what is that revenue rounded to the nearest dollar? 
> Note that revenue for a given product should be equal to the total unit price of that product times the quantity. You do not need to worry about the discount here. If you haven't multiplied columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [8]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT SUM("UnitPrice" * "Quantity") AS "Revenue", "ProductID"
FROM order_details
GROUP BY "ProductID"
ORDER BY "Revenue" DESC
LIMIT 1
OFFSET 4
"""

pd.read_sql_query(sql, engine)

        Revenue  ProductID
0  49827.899998         62

**Prompt 6 Answer**:

### Prompt 7

From the `products` table of the Northwind database, show the `ProductName`, `UnitsInStock`, and `UnitsOnOrder` values for those products who have more units on order than units in stock. Among these results, which product has the most units on order?

In [9]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT "ProductName", "UnitsInStock", "UnitsOnOrder"
FROM products
WHERE "UnitsInStock" < "UnitsOnOrder"
ORDER BY "UnitsOnOrder" DESC
LIMIT 1

"""

pd.read_sql_query(sql, engine)

                 ProductName  UnitsInStock  UnitsOnOrder
0  Louisiana Hot Spiced Okra             4           100

**Prompt 7 Answer**:

### Prompt 8

From the `order_details` table, show the products that have an average discount of at least 8%. Among these results, which average discount is closest to 8%?

In [21]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT "ProductID", avg("Discount")
FROM order_details
GROUP BY "ProductID"
HAVING avg("Discount") >= .08
ORDER BY "avg"("Discount") ASC
LIMIT 1
"""

pd.read_sql_query(sql, engine)

   ProductID      avg
0         30  0.08125

**Prompt 8 Answer**:

### Prompt 9

Return the `orders` table, but also include the first name, last name, and country of the employee assigned to each order. What is the first and last name of the employee assigned to `OrderID` 11077? (This is the last row in the data, provided that you do not sort.)

In [31]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT o.*, e."FirstName", e."LastName", e."Country"
FROM ORDERS as o
LEFT JOIN employees as e ON  e."EmployeeID" = o."EmployeeID"
WHERE o."OrderID" = 11077

"""

pd.read_sql_query(sql, engine)

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry,FirstName,LastName,Country
0,11077,RATTC,1,1998-05-06,1998-06-03,None,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA,Nancy,Davolio,USA

**Prompt 9 Answer**:

### Prompt 10

Find the average amount of freight across all orders, broken out by country of *employee*. (**NOT `ShipCountry`**.) How much higher is the average freight from UK employees than the average freight from US employees?

> For a bonus, round the freight to the nearest whole number and rename the column `Average Freight`.

In [47]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT avg(o."Freight") AS "Average Freight", e."Country"
FROM ORDERS AS o
LEFT JOIN EMPLOYEES AS e ON e."EmployeeID" = o."EmployeeID"
GROUP BY 2

"""

pd.read_sql_query(sql, engine)

   Average Freight Country
0        78.977143      UK
1        77.973284     USA

**Prompt 10 Answer**: Not sure how to do the subtraction or rounding here, but the average difference in freight here is 1.003859 or 1